         final cities = [
                      'الدوحة',
                      'الريان',
                      'الخور',
                      'الوكرة',
                      'الشمال',
                      'الشحانية',
                      'أم صلال',
                      'الظعاين',
                      'مسيعيد',
                      'لوسيل',
                      'رويس',
                      'جميلات',
                      'فويرط',
                      'لقطيفية',
                      'الغارية',
                      'زعفرانة',
                      'الحويلة'
                    ];