         final Map<String, List<String>> neighborhoods = {
  'الدوحة': [
    'البدع',
    'السد',
    'نجمة',
    'الهلال',
    'المطار القديم',
    'بن عمران',
    'مشيرب',
    'الدحيل',
    'مرخية',
    'لقديم'
  ],
  'الريان': [
    'معيذر',
    'اسلطة الجديدة',
    'ام السنيم',
    'الوعب',
    'ابوهامور',
    'الشحانية',
    'العزيزية',
    'روضة اقديم',
    'الريان الجديد'
  ],
  'الخور': [
    'الذخيرة',
    'القرم',
    'الثميد',
    'الكريب',
    'الخور المركزي',
    'الفلج'
  ],
  'الوكرة': [
    'الجبل',
    'الصناعية',
    'الجنوب',
    'ام بشر',
    'الوكرة القديمة'
  ],
  'الشمال': [
    'الصرعة',
    'ابوظلوف',
    'ابا الظلوف',
    'الغويرية'
  ],
  'الشحانية': [
    'الشحانية',
    'النعيم',
    'رويدات'
  ],
  'أم صلال': [
    'ام صلال محمد',
    'ام صلال علي',
    'ام عبيريه',
    'سميسمة'
  ],
  'الظعاين': [
    'روضة الحمامة',
    'الخيسة',
    'الطريف',
    'الوعب الشمالي'
  ],
  'مسيعيد': [
    'جر',
    'ام الحول',
    'منطقة المصانع'
  ],
  'لوسيل': [
    'قطيفان الشمالية',
    'المارينا',
    'الياقوت'
  ],
  'رويس': [
    'ميناء الرويس',
    'رويس القديم'
  ],
  'جميلات': [
    'جميلات'
  ],
  'فويرط': [
    'فويرط'
  ],
  'لقطيفية': [
    'لقطيفية'
  ],
  'الغارية': [
    'الغارية'
  ],
  'زعفرانة': [
    'زعفرانة'
  ],
  'الحويلة': [
    'الحويلة'
  ]
};